/**
 * # 자바스크립트의 핵심 개념
 *  
 *  * 객체
 *    + 자바스크립트의 거의 모든 것은 객체이다.
 *    + 기본 데이터 타입인 boolean, number, string 과 특별한 값인 null, undefined 를 제외하고 모두 객체이다.
 *    + 기본 데이터 타입도 객체처럼 다룰 수 있으므로 null과 undefined 를 제외한 모든 것을 객체로 다룰 수 있다.
 *  * 함수
 *    + 자바스크립트에서는 함수도 객체로 취급한다.
 *    + 일반적인 객체보다 조금 더 많은 기능이 있는 객체라고 할 수 있다.
 *    + 함수가 일급 객체(First class object)로 다뤄지기 때문에 매우 중요하다.
 *  * 프로토타입
 *    + 모든 객체는 숨겨진 링크(Link)인 프로토타입(Prototype)을 가진다.
 *    + 이 링크는 해당 객체를 생성한 생성자의 프로토타입 객체를 가리킨다.
 *    + 이 링크를 EcmaScript에서는 [[Prototype]] 이라 표현한다.
 */

 